muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(3, 1);
    lcd.print(timer2.hour);
  }
  else
  {
    lcd.print(timer2.hour);
  }
  lcd.setCursor(4, 1);
  lcd.print(":");
  lcd.setCursor(5, 1);
  if (timer2.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(6, 1);
    lcd.print(timer2.minute);
  }
  else
  {
    lcd.print(timer2.minute);
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(11, 1);
    lcd.print(timer3.hour);
  }
  else
  {
    lcd.print(timer3.hour);
  }
  lcd.setCursor(12, 1);
  lcd.print(":");
}

void displayTimerSelect()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");
  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer1.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer2.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer3.setting == 1)
  {
    lcd.print("On");
  }
}

void displayTimerSelectT1Edit()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");
  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer2.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer3.setting == 1)
  {
    lcd.print("On");
  }
}

void displayTimerSelectT2Edit()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");
  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer1.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
  lcd.setCursor(10, 1);
  if (timer3.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer3.setting == 1)
  {
    lcd.print("On");
  }
}

void displayTimerSelectT3Edit()
{
  lcd.setCursor(0, 0);
  lcd.print("Timer");
  lcd.setCursor(8, 0);
  lcd.write((uint8_t)1);
  lcd.setCursor(10, 0);
  if (timer1.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer1.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(0, 1);
  lcd.write((uint8_t)2);
  lcd.setCursor(2, 1);
  if (timer2.setting == 0)
  {
    lcd.print("Off");
  }
  if (timer2.setting == 1)
  {
    lcd.print("On");
  }

  lcd.setCursor(8, 1);
  lcd.write((uint8_t)3);
}

void displayDurationSet()
{
  lcd.setCursor(0, 0);
  lcd.print("Spray Duration");
  lcd.setCursor(0, 1);
  lcd.print(deviceSet.duration);
  lcd.setCursor(3, 1);
  lcd.print("min");
}

void displayDurationSetEdit()
{
  lcd.setCursor(0, 0);
  lcd.print("Spray Duration");
  lcd.setCursor(3, 1);
  lcd.print("min");
}

void displayBacklightSettings()
{
  lcd.setCursor(0, 0);
  lcd.print("Backlight");
  lcd.setCursor(0, 1);
  switch (deviceSet.backlight)
  {
  case 0:
    lcd.print("Always on");
    break;
  case 1:
    lcd.print("3 sec");
    break;
  case 2:
    lcd.print("5 sec");
    break;
  case 3:
    lcd.print("10 sec");
    break;
  case 4:
    lcd.print("Always off");
    break;
  }
}

void displayBacklightSettingsEdit()
{
  lcd.setCursor(0, 0);
  lcd.print("Backlight");
}

void displayRTCset()
{
  lcd.setCursor(0, 0);
  lcd.print("RTC Set");
  lcd.setCursor(0, 1);
  if (RTC.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(1, 1);
    lcd.print(RTC.hour);
  }
  else
  {
    lcd.print(RTC.hour);
  }
  lcd.setCursor(2, 1);
  lcd.print(":");
  lcd.setCursor(3, 1);
  if (RTC.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(4, 1);
    lcd.print(RTC.minute);
  }
  else
  {
    lcd.print(RTC.minute);
  }
}

void displayRTCsetHour()
{
  lcd.setCursor(0, 0);
  lcd.print("RTC Set");
  lcd.setCursor(2, 1);
  lcd.print(":");
  lcd.setCursor(3, 1);
  if (RTC.minute < 10)
  {
    lcd.print("0");
    lcd.setCursor(4, 1);
    lcd.print(RTC.minute);
  }
  else
  {
    lcd.print(RTC.minute);
  }
}

void displayRTCsetMinute()
{
  lcd.setCursor(0, 0);
  lcd.print("RTC Set");
  lcd.setCursor(0, 1);
  if (RTC.hour < 10)
  {
    lcd.print("0");
    lcd.setCursor(1, 1);
    lcd.print(RTC.hour);
  }
  else
  {
    lcd.print(RTC.hour);
  }
  lcd.setCursor(2, 1);
  lcd.print(":");
}

void displayFactoryReset()
{
  lcd.setCursor(0, 0);
  lcd.print("Factory Reset");
}

void displayFactoryResetConfirm()
{
  lcd.setCursor(0, 0);
  lcd.print("Confirm?");
  lcd.setCursor(0, 1);
  lcd.print("Arrow to Cancel");
}

// Menu display function -------------------------------------

void displayMenu()
{
  if (state == 0 && btn_set == 0)
  { // state 0, main menu
    displayMain();
  }

  if (state == 1 && btn_set == 0)
  { // state 1, temp set menu
    displayTempSet();
  }

  if (state == 1 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTempSetEdit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTempSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 2 && btn_set == 0)
  { // state 2, timer set menu
    displayTimeSet();
  }

  if (state == 2 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT1Hour();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 2 && btn_set == 2)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT1Minute();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

