muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  if (state == 2 && btn_set == 3)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT2Hour();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 2 && btn_set == 4)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT2Minute();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 2 && btn_set == 5)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT3Hour();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 2 && btn_set == 6)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimeSetT3Minute();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimeSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 3 && btn_set == 0)
  { // state 3, choose timer on
    displayTimerSelect();
  }

  if (state == 3 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimerSelectT1Edit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimerSelect();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 3 && btn_set == 2)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimerSelectT2Edit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimerSelect();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 3 && btn_set == 3)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayTimerSelectT3Edit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayTimerSelect();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 4 && btn_set == 0)
  { // state 4, set spray duration
    displayDurationSet();
  }

  if (state == 4 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayDurationSetEdit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayDurationSet();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 5 && btn_set == 0)
  { // state 5, set backlight mode
    displayBacklightSettings();
  }

  if (state == 5 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayBacklightSettingsEdit();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayBacklightSettings();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 6 && btn_set == 0)
  { // state 6, set RTC time
    displayRTCset();
  }

  if (state == 6 && btn_set == 1)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayRTCsetHour();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayRTCset();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 6 && btn_set == 2)
  {
    if (millis() - counter_blink > 750 && blinker == 0)
    {
      lcd.clear();
      displayRTCsetMinute();
      counter_blink = millis();
      blinker = 1;
    }
    if (millis() - counter_blink > 750 && blinker == 1)
    {
      lcd.clear();
      displayRTCset();
      counter_blink = millis();
      blinker = 0;
    }
  }

  if (state == 7 && btn_set == 0)
  { // state 7, reset factory setting
    displayFactoryReset();
  }
  if (state == 7 && btn_set == 1)
  {
    displayFactoryResetConfirm();
  }
}

void buttonMenu()
{
  if (btn_set == 0)
  {
    if (buttonRead(buttonUp) == true && state > 0)
    {
      state--;
      lcd.clear();
    }
    if (buttonRead(buttonDown) == true && state < 7)
    {
      state++;
      lcd.clear();
    }
    if (buttonRead(buttonSet) == true && state > 0)
    {
      btn_set = 1;
      lcd.clear();
    }
  }

  if (state == 1 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      temperature.threshold = temperature.threshold + 0.1;
    }
    if (buttonRead(buttonDown) == true)
    {
      temperature.threshold = temperature.threshold - 0.1;
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(0, temperature.threshold);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 2 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer1.hour < 23)
      {
        timer1.hour++;
      }
      else
      {
        timer1.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer1.hour > 0)
      {
        timer1.hour--;
      }
      else
      {
        timer1.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 2 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer1.minute < 59)
      {
        timer1.minute++;
      }
      else if (timer1.hour < 23)
      {
        timer1.minute = 0;
        timer1.hour++;
      }
      else
      {
        timer1.minute = 0;
        timer1.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer1.minute > 0)
      {
        timer1.minute--;
      }
      else if (timer1.hour > 0)
      {
        timer1.minute = 59;
        timer1.hour--;
      }
      else
      {
        timer1.minute = 59;
        timer1.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 3;
    }
  }

