muryamuya/auto-spray-esp8266-atmega328p/auto_spray_main/src/auto_spray_main_wifi.cpp
  if (state == 2 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.hour < 23)
      {
        timer2.hour++;
      }
      else
      {
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.hour > 0)
      {
        timer2.hour--;
      }
      else
      {
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 4;
    }
  }

  if (state == 2 && btn_set == 4)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer2.minute < 59)
      {
        timer2.minute++;
      }
      else if (timer2.hour < 23)
      {
        timer2.minute = 0;
        timer2.hour++;
      }
      else
      {
        timer2.minute = 0;
        timer2.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer2.minute > 0)
      {
        timer2.minute--;
      }
      else if (timer2.hour > 0)
      {
        timer2.minute = 59;
        timer2.hour--;
      }
      else
      {
        timer2.minute = 59;
        timer2.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 5;
    }
  }

  if (state == 2 && btn_set == 5)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.hour < 23)
      {
        timer3.hour++;
      }
      else
      {
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.hour > 0)
      {
        timer3.hour--;
      }
      else
      {
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 6;
    }
  }

  if (state == 2 && btn_set == 6)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (timer3.minute < 59)
      {
        timer3.minute++;
      }
      else if (timer3.hour < 23)
      {
        timer3.minute = 0;
        timer3.hour++;
      }
      else
      {
        timer3.minute = 0;
        timer3.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (timer3.minute > 0)
      {
        timer3.minute--;
      }
      else if (timer3.hour > 0)
      {
        timer3.minute = 59;
        timer3.hour--;
      }
      else
      {
        timer3.minute = 59;
        timer3.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(6, timer1.hour);
      EEPROM.put(7, timer1.minute);
      EEPROM.put(9, timer2.hour);
      EEPROM.put(10, timer2.minute);
      EEPROM.put(12, timer3.hour);
      EEPROM.put(13, timer3.minute);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 3 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer1.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer1.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 3 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer2.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer2.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 3;
    }
  }

  if (state == 3 && btn_set == 3)
  {
    if (buttonRead(buttonUp) == true)
    {
      timer3.setting = 1;
    }
    if (buttonRead(buttonDown) == true)
    {
      timer3.setting = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(8, timer1.setting);
      EEPROM.put(11, timer2.setting);
      EEPROM.put(14, timer3.setting);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 4 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.duration < 60)
      {
        deviceSet.duration++;
      }
      else
      {
        deviceSet.duration = 1;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.duration > 1)
      {
        deviceSet.duration--;
      }
      else
      {
        deviceSet.duration = 60;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(5, deviceSet.duration);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 5 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (deviceSet.backlight > 0)
      {
        deviceSet.backlight--;
      }
      else
      {
        deviceSet.backlight = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (deviceSet.backlight < 4)
      {
        deviceSet.backlight++;
      }
      else
      {
        deviceSet.backlight = 4;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      EEPROM.put(4, deviceSet.backlight);
      EEPROM.commit();
      btn_set = 0;
    }
  }

  if (state == 6 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.hour < 23)
      {
        RTC.hour++;
      }
      else
      {
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.hour > 0)
      {
        RTC.hour--;
      }
      else
      {
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      btn_set = 2;
    }
  }

  if (state == 6 && btn_set == 2)
  {
    if (buttonRead(buttonUp) == true)
    {
      if (RTC.minute < 59)
      {
        RTC.minute++;
      }
      else if (RTC.hour < 23)
      {
        RTC.minute = 0;
        RTC.hour++;
      }
      else
      {
        RTC.minute = 0;
        RTC.hour = 0;
      }
    }
    if (buttonRead(buttonDown) == true)
    {
      if (RTC.minute > 0)
      {
        RTC.minute--;
      }
      else if (RTC.hour > 0)
      {
        RTC.minute = 59;
        RTC.hour--;
      }
      else
      {
        RTC.minute = 59;
        RTC.hour = 23;
      }
    }
    if (buttonRead(buttonSet) == true)
    {
      setDS3231time(00, RTC.minute, RTC.hour, 7, 01, 10, 22);
      btn_set = 0;
    }
  }

  if (state == 7 && btn_set == 1)
  {
    if (buttonRead(buttonUp) == true || buttonRead(buttonDown) == true)
    {
      lcd.clear();
      btn_set = 0;
    }
    if (buttonRead(buttonSet) == true)
    {
      factoryReset();
      lcd.clear();
      lcd.setCursor(4, 0);
      lcd.print("Success!");
      delay(2000);
      lcd.clear();
      btn_set = 0;
      state = 0;
    }
  }
}

// Web function ----------------------------------------------

String statusTimer(byte status)
{
  if (status == 1)
  {
    return "On";
  }
  else
    return "Off";
}

String processor(const String &var)
{
  if (var == "TEMPPLACEHOLDER")
  {
    return String(temperature.celcius);
  }
  if (var == "TIMEPLACEHOLDER")
  {
    return String(RTC.hour + ":" + RTC.minute);
  }
  if (var == "THRESHOLDPLACEHOLDER")
  {
    return String(temperature.threshold);
  }
  if (var == "TIMER1PLACEHOLDER")
  {
    return String(timer1.hour + ":" + timer1.minute);
  }
  if (var == "STATUS1PLACEHOLDER")
  {
    return statusTimer(timer1.setting);
  }
  if (var == "TIMER2PLACEHOLDER")
  {
    return String(timer2.hour + ":" + timer2.minute);
  }
  if (var == "STATUS2PLACEHOLDER")
  {
    return statusTimer(timer2.setting);
  }
  if (var == "TIMER3PLACEHOLDER")
  {
    return String(timer3.hour + ":" + timer3.minute);
  }
  if (var == "STATUS3PLACEHOLDER")
  {
    return statusTimer(timer3.setting);
  }
  if (var == "DURATIONPLACEHOLDER")
  {
    return String(deviceSet.duration);
  }
  return String();
}

void setupServer()
{
  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send(LittleFS, "/index.html", String(), false, processor); });

  webServer.serveStatic("/", LittleFS, "/");

  webServer.on("/temp", HTTP_GET, [](AsyncWebServerRequest *request)
               {
    fl2b.value = temperature.celcius;
    request->send_P(200, "text/plain", fl2b.text); });

  webServer.on("/time", HTTP_GET, [](AsyncWebServerRequest *request)
               { request->send_P(200, "text/plain", String(RTC.hour + ":" + RTC.minute).c_str()); });

  webServer.on("/wifi", HTTP_POST, [](AsyncWebServerRequest *request)
               {
    int params = request->params();
    for (int i=0; i<params; i++){
      AsyncWebParameter* p = request->getParam(i);
      if(p->isPost()){
        if (p->name() == "ssid") {
          strcpy(deviceSet.ssid, p->value().c_str());
          len = strlen(deviceSet.ssid);
          EEPROM.put(15, len);
          for(int i=0; i<len; i++){
            EEPROM.put(16 + i, deviceSet.ssid[i]);
          }
          }
        if (p->name() == "pass") {
          strcpy(deviceSet.pass, p->value().c_str());
          len = strlen(deviceSet.pass);
          EEPROM.put(48, len);
          for(int i=0; i<len; i++){
            EEPROM.put(49 + i, deviceSet.pass[i]);
          }
          }
        EEPROM.commit();
        request->send(200, "text/plain", "Done, ESP will restart.");
        restart = true;
      }
    } });
}

// Main function ---------------------------------------------

void setup()
{
  LittleFS.begin();
  // Serial.begin(9600);
  EEPROM.begin(EEPROM_SIZE);
  fetchEEPROM();
  Wire.begin(1);
  pinMode(buttonUp, INPUT_PULLUP);
  pinMode(buttonDown, INPUT_PULLUP);
  pinMode(buttonSet, INPUT_PULLUP);
  lcd.init();
  lcd.backlight();
  lcd.createChar(0, charDegree);
  lcd.createChar(1, charT1);
  lcd.createChar(2, charT2);
  lcd.createChar(3, charT3);
  lcd.setCursor(0, 0);
  lcd.print("Multitechnologi");
  delay(3000);
  lcd.clear();
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(APIP, APIP, subnet_mask);
  WiFi.softAP(deviceSet.ssid, deviceSet.pass);
  setupServer();
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  webServer.addHandler(new CaptiveRequestHandler()).setFilter(ON_AP_FILTER);
  webServer.begin();
}

void loop()
{
  receiveStatus();
  buttonMenu();
  displayMenu();
  backlightMode();
  sendSettings();
  dnsServer.processNextRequest();
  if (restart)
  {
    delay(5000);
    ESP.restart();
  }
  // debugging();
}
